---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthBelowMin
source: html/30fa5190-cde3-37cc-7352-8303284bea0e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthBelowMin Property

The Actual Tread Depth for one or more Stairs violates the Minimum Depth set in the type.

## Syntax (C#)
```csharp
public static FailureDefinitionId TreadDepthBelowMin { get; }
```